[
  {
    "pregunta": "¿Qué tipo de compuerta tiene como salida 1 solo si ambas entradas son diferentes?",
    "opciones": [
      "Compuerta AND",
      "Compuerta OR",
      "Compuerta XNOR",
      "Compuerta XOR"
    ],
    "respuesta": 3,
    "explicacion": "La compuerta XOR (O exclusiva) produce un 1 únicamente cuando las entradas son distintas (0-1 o 1-0)."
  },
  {
    "pregunta": "¿Cuál es la principal ventaja de un velocímetro digital (electrónico) frente a uno analógico (mecánico)?",
    "opciones": [
      "El digital requiere menos energía para funcionar.",
      "El digital permite que los datos sean procesados y transmitidos de forma precisa, fiable y eficiente.",
      "El analógico es intrínsecamente más preciso a altas velocidades.",
      "El digital es más barato de fabricar que el analógico."
    ],
    "respuesta": 1,
    "explicacion": "La principal ventaja de los datos digitales es su capacidad para ser procesados, almacenados y transmitidos a otros sistemas (como la ECU o sistemas de navegación) con alta precisión y sin interferencias."
  },
  {
    "pregunta": "¿Qué se obtiene al negar (o invertir) la salida de una compuerta AND?",
    "opciones": [
      "Una compuerta OR",
      "Una compuerta XOR",
      "Una compuerta NAND",
      "Una compuerta NOR"
    ],
    "respuesta": 2,
    "explicacion": "La compuerta NAND es la forma negada (NOT) de la compuerta AND. Su función es la negación de la conjunción lógica, es decir, solo produce un 0 cuando todas las entradas son 1."
  },
  {
    "pregunta": "¿Cuál es la función principal de un mapa de Karnaugh (K-map) en la lógica digital?",
    "opciones": [
      "Es una herramienta para simular el comportamiento de un microprocesador.",
      "Es una herramienta para simplificar expresiones booleanas complejas.",
      "Es un método para convertir números binarios a código BCD.",
      "Es un diagrama para visualizar el flujo de datos en un circuito secuencial."
    ],
    "respuesta": 1,
    "explicacion": "El mapa de Karnaugh es una técnica gráfica que permite simplificar o minimizar expresiones lógicas booleanas, lo que reduce el número de compuertas necesarias en el circuito final."
  },
  {
    "pregunta": "¿Cuál es la forma simplificada de la expresión booleana A + A · B?",
    "opciones": [
      "A",
      "B",
      "A · B",
      "A + B"
    ],
    "respuesta": 0,
    "explicacion": "Esta expresión se simplifica utilizando la Ley de Absorción del Álgebra Booleana, donde A + (A · B) es igual a A. Esto es porque si A ya es 1, la salida es 1; si A es 0, la expresión es 0 + 0·B, que es 0. La salida siempre sigue el valor de A. "
  },
  {
    "pregunta": "¿A qué compuerta lógica corresponde la señal digital de salida 'X' basada en el diagrama de tiempos de las entradas 'A' y 'B'?",
    "opciones": [
      "Compuerta NAND",
      "Compuerta NOR",
      "Compuerta XNOR",
      "Compuerta XOR"
    ],
    "respuesta": 3,
    "explicacion": "Al analizar el diagrama, la salida 'X' se activa (valor 1) únicamente cuando las entradas 'A' y 'B' tienen valores lógicos diferentes. Este comportamiento es la definición funcional de la compuerta XOR (O Exclusiva).",
    "imagen": "imagen/salida-xor.png" 
  },
  {
    "pregunta": "En un circuito de compuertas OR, ¿cuál es la salida si al menos una entrada es 1?",
    "opciones": [
      "La salida siempre es 0.",
      "La salida es 1.",
      "La salida es de alta impedancia (Z).",
      "La salida se mantiene en su estado anterior."
    ],
    "respuesta": 1,
    "explicacion": "La compuerta OR (disyunción lógica) se activa o produce un 1 lógico si y solo si una o más de sus entradas están en estado 1 (Verdadero). Esta es su característica principal."
  },
  {
    "pregunta": "¿Qué representa una tabla de verdad, como la mostrada en la imagen, en el contexto de un circuito lógico?",
    "opciones": [
      "La secuencia de bits de entrada en el tiempo.",
      "La salida de un circuito en función de sus entradas.",
      "El número de transistores utilizados en la compuerta.",
      "La simplificación del diagrama de un mapa de Karnaugh."
    ],
    "respuesta": 1,
    "explicacion": "Una tabla de verdad es una herramienta utilizada en la lógica booleana para mostrar el comportamiento de un circuito lógico; lista todas las posibles combinaciones de las entradas y la salida resultante para cada combinación."
  },
  {
    "pregunta": "¿Cuál es la salida de una compuerta OR si ambas entradas son 0?",
    "opciones": [
      "1",
      "0",
      "Alta impedancia (Z)",
      "Indefinido"
    ],
    "respuesta": 1,
    "explicacion": "La compuerta OR requiere que al menos una entrada sea 1 para activarse. Si ambas son 0, la salida es 0."
  },
  {
    "pregunta": "¿En cuál de los siguientes casos se utilizaría un valor don't care (X)?",
    "opciones": [
      "Para forzar la salida a 1 en todo momento.",
      "Cuando un sensor de movimiento esté en nivel alto y bajo simultáneamente (estado imposible).",
      "Cuando se necesita reiniciar el sistema.",
      "Cuando se desconecta la fuente de poder."
    ],
    "respuesta": 1,
    "explicacion": "Los estados 'don't care' se usan en mapas de Karnaugh para combinaciones de entrada que físicamente no pueden ocurrir o no importan."
  },
  {
    "pregunta": "¿Cómo se representa la función lógica NOT en un diagrama lógico?",
    "opciones": [
      "Un círculo pequeño o burbuja en la salida",
      "Un cuadrado con una X dentro",
      "Una línea curva sin cierre",
      "Un rectángulo con el símbolo &"
    ],
    "respuesta": 0,
    "explicacion": "Gráficamente, la inversión (NOT) se denota con un pequeño círculo (burbuja), usualmente a la salida de un triángulo."
  },
  {
    "pregunta": "En el álgebra booleana, ¿cuál es la expresión simplificada de A + A'?",
    "opciones": [
      "0",
      "A",
      "A'",
      "1"
    ],
    "respuesta": 3,
    "explicacion": "Es una ley fundamental: sumar una variable con su inverso (A + A') siempre cubre todas las posibilidades, resultando en 1 (Verdadero)."
  },
  {
    "pregunta": "¿Cuál es la salida de una compuerta AND si ambas entradas son 1?",
    "opciones": [
      "0",
      "1",
      "Oscilante",
      "Null"
    ],
    "respuesta": 1,
    "explicacion": "La compuerta AND solo entrega una salida de 1 (Verdadero) cuando TODAS sus entradas son 1."
  },
  {
    "pregunta": "En un mapa de Karnaugh de dos variables, ¿cuántas celdas hay?",
    "opciones": [
      "2 celdas",
      "4 celdas",
      "8 celdas",
      "16 celdas"
    ],
    "respuesta": 1,
    "explicacion": "El número de celdas es 2 elevado al número de variables. Para 2 variables: 2^2 = 4."
  },
  {
    "pregunta": "¿Cuál es la salida de una compuerta NAND cuando ambas entradas son 0?",
    "opciones": [
      "0",
      "1",
      "Flotante",
      "Error de lógica"
    ],
    "respuesta": 1,
    "explicacion": "La NAND es la inversa de la AND. Si las entradas son 0 y 0, la AND daría 0. Al invertirlo, la NAND da 1."
  },
  {
    "pregunta": "De acuerdo a la compuerta lógica OR mostrada en la imagen, ¿cuál de las siguientes opciones representa correctamente la secuencia de sus salidas (S) para las combinaciones 00, 01, 10 y 11?",
    "opciones": [
      "0000",
      "0111",
      "1000",
      "1111"
    ],
    "respuesta": 1,
    "explicacion": "La compuerta OR produce una salida de 1 si al menos una de las entradas (A o B) es 1. Por lo tanto, la secuencia de salidas es S=0 para (0,0); S=1 para (0,1); S=1 para (1,0); y S=1 para (1,1).",
    "imagen": "imagen/Compuerta-or.png" 
  },
  {
    "pregunta": "¿Cuál sería el valor de las salidas Q y Qn si en el circuito biestable RS (Flip-Flop) mostrado, el valor del LOGICSTATE en la transición es R=0 y S=0, asumiendo que el circuito estaba previamente en un estado de Set (Q=1, Qn=0)?",
    "opciones": [
      "La salida Q cambia a cero y Qn cambia a uno.",
      "La salida Q y Qn cambian a cero.",
      "La salida Q permanece en uno y Qn permanece en cero.",
      "La salida Q y Qn cambian a uno."
    ],
    "respuesta": 2,
    "explicacion": "El circuito mostrado es un biestable RS. La condición R=0 y S=0 corresponde a la 'zona de memoria' del biestable (ya que usa compuertas NAND y NOR en cascada). Cuando las entradas R y S son 0, el biestable retiene el último estado. Dado que el estado anterior era Set (Q=1, Qn=0), este estado se mantiene.",
    "imagen": "imagen/salida-q.png"
  }
] 
