[
  {
    "pregunta": "¿Qué tipo de compuerta tiene como salida 1 solo si ambas entradas son diferentes?",
    "opciones": [
      "Compuerta AND",
      "Compuerta OR",
      "Compuerta XNOR",
      "Compuerta XOR"
    ],
    "respuesta": 3,
    "explicacion": "La compuerta XOR (O exclusiva) produce un 1 únicamente cuando las entradas son distintas (0-1 o 1-0)."
  },
  {
    "pregunta": "¿Qué función realiza un circuito combinatorio?",
    "opciones": [
      "Almacena el estado de la salida anterior para usarlo en la siguiente operación.",
      "Realiza una operación lógica basada únicamente en las entradas actuales.",
      "Depende de una señal de reloj para cambiar de estado.",
      "Convierte datos binarios en señales analógicas."
    ],
    "respuesta": 1,
    "explicacion": "Un circuito combinatorio (o combinacional) produce una salida que es el resultado directo y exclusivo de las entradas que recibe en ese mismo instante, sin depender del tiempo ni de estados anteriores."
  },
  {
    "pregunta": "¿Cuál es la principal ventaja de un velocímetro digital frente a uno analógico?",
    "opciones": [
      "El digital es más robusto a los cambios de temperatura.",
      "El digital permite que los datos puedan ser procesados y transmitidos de forma precisa, fiable y eficiente.",
      "El analógico es más sencillo de calibrar después de la instalación.",
      "El digital tiene un rango de medición más pequeño."
    ],
    "respuesta": 1,
    "explicacion": "La principal ventaja de la tecnología digital no es solo la visualización, sino la capacidad de transmitir el dato a otros sistemas (computadoras de a bordo, sistemas de control) con alta precisión y baja interferencia."
  },
  {
    "pregunta": "¿Cómo se representa la función lógica NOT en un diagrama lógico?",
    "opciones": [
      "Con un símbolo de punto grande.",
      "Con un triángulo en la salida.",
      "Con un círculo pequeño (burbuja) en la salida.",
      "Con el símbolo & dentro de la compuerta."
    ],
    "respuesta": 2,
    "explicacion": "La función NOT (inversor) se representa usando un pequeño círculo o 'burbuja' en la línea de salida o entrada de cualquier compuerta. "
  },
  {
    "pregunta": "¿Cuál es la función principal de la compuerta lógica NOR?",
    "opciones": [
      "Realizar la operación AND de las negaciones de las entradas.",
      "Negar el resultado de una compuerta OR.",
      "Negar el resultado de una compuerta AND.",
      "Solo genera un 1 si las entradas son diferentes."
    ],
    "respuesta": 1,
    "explicacion": "La compuerta NOR (Not OR) es la negación del resultado de la operación OR. Solo produce un 1 cuando todas sus entradas son 0."
  },
  [
  {
    "pregunta": "¿Cuál es la principal característica de un flip-flop tipo T (Toggle)?",
    "opciones": [
      "Almacena la entrada D en el flanco de reloj.",
      "Cambia su estado (complementa Q) con cada pulso de reloj cuando su entrada T es alta.",
      "Permite las entradas R=0 y S=0 como estado de conmutación.",
      "Su salida es función del estado presente y de la entrada."
    ],
    "respuesta": 1,
    "explicacion": "El flip-flop tipo T (Toggle) opera en modo de conmutación o 'Toggle', alternando su estado Q al estado opuesto en cada ciclo de reloj si su entrada de control T está activa."
  },
  {
    "pregunta": "¿Qué concepto es equivalente al 'factor de proporcionalidad' dentro de un Convertidor Digital-Analógico (DAC)?",
    "opciones": [
      "Tiempo de asentamiento (Settling Time).",
      "Error de cuantización.",
      "Frecuencia de muestreo.",
      "Resolución (o tamaño del paso)."
    ],
    "respuesta": 3,
    "explicacion": "La resolución define la menor cantidad de voltaje analógico que corresponde a un cambio de un bit en la entrada digital, estableciendo el factor de proporcionalidad entre el valor digital y el valor analógico de salida. "
  },
  {
    "pregunta": "¿Cuál es el número total de pasos discretos (o valores diferentes) disponibles en la salida de un Convertidor Digital-Analógico (DAC) de 8 bits?",
    "opciones": [
      "256 pasos.",
      "8 pasos.",
      "255 pasos.",
      "16 pasos."
    ],
    "respuesta": 2,
    "explicacion": "El número de pasos posibles es $2^N - 1$, donde $N=8$, lo que resulta en $2^8 - 1 = 255$ pasos discretos."
  },
  {
    "pregunta": "¿Cuál es la función de una LUT (Look-up Table) dentro de un FPGA?",
    "opciones": [
      "Es el circuito que gestiona la distribución de la señal de reloj principal.",
      "Es la memoria RAM utilizada para almacenar grandes bloques de datos.",
      "Es un tipo de memoria programable que se utiliza para generar funciones lógicas combinacionales.",
      "Gestiona las interconexiones entre diferentes bloques lógicos del chip."
    ],
    "respuesta": 2,
    "explicacion": "La LUT (Tabla de Búsqueda) es el componente básico del FPGA que almacena la tabla de verdad de una función lógica, permitiendo implementar lógica combinacional reconfigurable."
  },
  {
    "pregunta": "¿Qué tipo de programación se utiliza comúnmente para programar FPGAs?",
    "opciones": [
      "Programación de alto nivel (como C o Python) enfocada en la ejecución secuencial.",
      "Programación de hardware utilizando lenguajes como VHDL o Verilog.",
      "Programación de ensamblador para sistemas operativos embebidos.",
      "Diagramas de flujo basados en la lógica de relevadores (Ladder Logic)."
    ],
    "respuesta": 1,
    "explicacion": "Los FPGAs se configuran usando Lenguajes de Descripción de Hardware (HDLs) que definen la estructura y el comportamiento paralelo del hardware."
  },
  {
    "pregunta": "¿Cuál es una característica clave de los sistemas embebidos?",
    "opciones": [
      "Utilizan sistemas operativos estándar como Windows o Linux.",
      "Son altamente personalizables y específicos para una aplicación o tarea particular.",
      "Su diseño se basa exclusivamente en microprocesadores de alto rendimiento.",
      "Son fácilmente modificables y reutilizables para cualquier tipo de tarea futura."
    ],
    "respuesta": 1,
    "explicacion": "Los sistemas embebidos están diseñados con hardware y software a medida para realizar una función muy específica, optimizando recursos y costo."
  },
  {
    "pregunta": "¿Cuál es la salida de una compuerta NAND cuando ambas entradas son 0?",
    "opciones": [
      "0",
      "1",
      "Flotante (Alta impedancia)",
      "Error de lógica"
    ],
    "respuesta": 1,
    "explicacion": "La compuerta NAND niega la operación AND. Como 0 AND 0 es 0, la negación (NAND) es 1."
  },
  {
    "pregunta": "¿Cuál es la función principal de un flip-flop tipo D?",
    "opciones": [
      "Permitir la conmutación de la salida (Toggle) con cada pulso de reloj.",
      "Almacenar una entrada (Dato) cuando se activa una señal de reloj.",
      "Establecer la salida Q a 1 y Q' a 0 sin depender del reloj.",
      "Sincronizar dos señales de reloj diferentes en un mismo circuito."
    ],
    "respuesta": 1,
    "explicacion": "El flip-flop tipo D (Data) funciona como una celda de memoria que transfiere el valor presente en su entrada D a la salida Q al recibir un pulso de reloj."
  },
  {
    "pregunta": "Señale el concepto que más se ajusta al modelo de Mealy",
    "opciones": [
      "Las salidas dependen únicamente del estado presente en los biestables.",
      "Las salidas dependen del estado presente y de las entradas actuales.",
      "El siguiente estado depende solo de las entradas actuales y no del reloj.",
      "El circuito se construye exclusivamente con flip-flops tipo JK."
    ],
    "respuesta": 1,
    "explicacion": "En el modelo de Mealy, la salida se determina por el estado actual de los biestables Y por las entradas externas que recibe el circuito en ese instante."
  },
  {
    "pregunta": "¿Cuál de las siguientes afirmaciones es correcta sobre las FPGAs?",
    "opciones": [
      "Son procesadores que utilizan un sistema operativo estándar.",
      "Son memorias no volátiles utilizadas para almacenar firmware.",
      "Son circuitos integrados que pueden ser configurados para realizar tareas específicas a nivel de hardware.",
      "Son dispositivos predefinidos (ASIC) que no permiten modificación."
    ],
    "respuesta": 2,
    "explicacion": "Los FPGAs son configurables por el usuario (programables en campo) para implementar lógica dedicada y personalizada."
  },
  {
    "pregunta": "¿Qué lenguaje de programación se utiliza comúnmente para programar FPGAs?",
    "opciones": [
      "Python o Java.",
      "Programación de ensamblador.",
      "VHDL o Verilog (Lenguajes de Descripción de Hardware).",
      "C o C++."
    ],
    "respuesta": 2,
    "explicacion": "VHDL y Verilog son los lenguajes de descripción de hardware (HDLs) más usados para definir la lógica paralela de los FPGAs."
  },
  {
    "pregunta": "¿Qué tipo de programación es común para programar microcontroladores?",
    "opciones": [
      "Programación de hardware utilizando VHDL.",
      "Programación de alto nivel (como C o C++).",
      "Programación basada en lógica de fluidos.",
      "Programación por interconexión de nodos lógicos."
    ],
    "respuesta": 1,
    "explicacion": "Los microcontroladores se programan comúnmente con lenguajes de alto nivel como C/C++ por su eficiencia y su sintaxis clara."
  },
  {
    "pregunta": "¿Qué operación lógica representa la expresión $A \\cdot B$ en álgebra booleana?",
    "opciones": [
      "A OR B (Disyunción)",
      "A AND B (Conjunción)",
      "A XOR B (O Exclusiva)",
      "A NOT B (Inversión)"
    ],
    "respuesta": 1,
    "explicacion": "En álgebra booleana, el punto medio ($\cdot$) o la simple yuxtaposición (AB) representa la operación de multiplicación lógica, que es la operación AND o conjunción."
  },
  {
    "pregunta": "¿Qué tipo de conversión realiza un sistema PISO (Parallel-In, Serial-Out)?",
    "opciones": [
      "Convierte datos en serie a un formato paralelo.",
      "Convierte datos paralelos a un formato en serie (serial).",
      "Convierte señales analógicas a digitales.",
      "Convierte señales digitales a analógicas."
    ],
    "respuesta": 1,
    "explicacion": "Un registro de desplazamiento PISO toma varios bits de datos simultáneamente (en paralelo) y los envía uno por uno (en serie)."
  },
  {
    "pregunta": "¿Qué tipo de máquina secuencial utiliza la lógica combinacional para determinar el siguiente estado?",
    "opciones": [
      "Máquina secuencial asíncrona.",
      "Máquina secuencial síncrona.",
      "Máquina de Turing.",
      "Máquina de estados de Mealy."
    ],
    "respuesta": 1,
    "explicacion": "Las máquinas secuenciales síncronas utilizan lógica combinacional para calcular el 'siguiente estado' basándose en el estado actual y las entradas, pero solo cambian de estado cuando reciben un pulso de reloj (sincronización)."
  },
  {
    "pregunta": "¿Qué es un convertidor Analógico-Digital (AD)?",
    "opciones": [
      "Un dispositivo que convierte señales digitales a analógicas (DAC).",
      "Un dispositivo que convierte señales analógicas a digitales (ADC).",
      "Un dispositivo que convierte datos paralelos a seriales.",
      "Un dispositivo que convierte la frecuencia de la señal."
    ],
    "respuesta": 1,
    "explicacion": "Un Convertidor Analógico-Digital (ADC) convierte una señal analógica continua (como voltaje o temperatura) en una representación digital discreta."
  },
  {
    "pregunta": "¿Qué significa la 'distancia unitaria' en una Máquina Secuencial Asíncrona (MSA)?",
    "opciones": [
      "Que el reloj debe tener una frecuencia de 1 Hz.",
      "Que solo se puede pasar entre estados cuyas entradas difieren en un único bit.",
      "Que no se puede pasar de las entradas 00 a 11 directamente.",
      "Que el tiempo de transición entre estados es constante."
    ],
    "respuesta": 1,
    "explicacion": "La distancia unitaria o código Gray asegura que entre estados adyacentes de la MSA, solo cambie el valor de una variable de entrada a la vez, evitando estados intermedios impredecibles (riesgos)."
  },
  {
    "pregunta": "¿Cuál es la característica principal de un microcontrolador?",
    "opciones": [
      "Es un CPU con disco duro y tarjeta de video integrados.",
      "Es un procesador con memoria RAM y ROM integradas en el mismo chip.",
      "Es un dispositivo diseñado exclusivamente para el control de potencia.",
      "Es un circuito integrado que solo implementa lógica combinacional."
    ],
    "respuesta": 1,
    "explicacion": "Un microcontrolador es una computadora compacta que incluye el procesador (CPU), memoria RAM, memoria ROM (para firmware) y periféricos de entrada/salida, todo en un único chip."
  },
  {
    "pregunta": "Señale dos elementos que componen la arquitectura de un FPGA.",
    "opciones": [
      "CLB (Bloque Lógico Configurable) y Matrices de Interconexión.",
      "CPU de alto rendimiento y sistema operativo RTOS.",
      "Disco duro SSD y memoria cache L3.",
      "Unidades de Punto Flotante y Microprocesador."
    ],
    "respuesta": 0,
    "explicacion": "Los bloques lógicos configurables (CLB) y las matrices de interconexión programables son los elementos fundamentales que permiten a un FPGA ser reconfigurable."
  },
  {
    "pregunta": "En un registro SIPO (Serial-In, Parallel-Out), ¿cómo se presentan las salidas?",
    "opciones": [
      "Una a la vez, de forma serial.",
      "Todas a la vez en forma paralela.",
      "Solo cuando la entrada serial es 1.",
      "La salida es un valor analógico."
    ],
    "respuesta": 1,
    "explicacion": "El registro SIPO recibe los datos bit a bit (en serie) y, una vez que el registro está lleno, presenta todos los bits almacenados simultáneamente en sus salidas paralelas."
  },
  {
    "pregunta": "En una máquina secuencial asincrónica, ¿cómo se determina el siguiente estado?",
    "opciones": [
      "A través del flanco positivo de la señal de reloj principal.",
      "A través de los cambios en las entradas (sin depender del reloj).",
      "Mediante una tabla de verdad fija grabada en la memoria.",
      "Por medio de un temporizador interno programable."
    ],
    "respuesta": 1,
    "explicacion": "Una máquina secuencial asíncrona no utiliza una señal de reloj global; sus cambios de estado se disparan inmediatamente por los cambios en las variables de entrada."
  },
  {
    "pregunta": "¿Cuál es la característica clave de las memorias EEPROM?",
    "opciones": [
      "Es una memoria RAM volátil que se borra al apagar el equipo.",
      "Es una ROM programable y borrable por luz ultravioleta.",
      "Es una ROM programable y borrable eléctricamente.",
      "Es una memoria de solo lectura que nunca puede ser modificada."
    ],
    "respuesta": 2,
    "explicacion": "EEPROM (Electrically Erasable Programmable Read-Only Memory) es un tipo de memoria ROM que puede ser borrada y reprogramada mediante señales eléctricas, sin necesidad de retirar el chip del circuito."
  },
  {
    "pregunta": "¿Cuál es la diferencia esencial entre la arquitectura de Harvard y Von Neumann?",
    "opciones": [
      "Von Neumann es usada por microcontroladores, Harvard por PCs.",
      "Von Neumann utiliza memorias separadas para datos e instrucciones; Harvard utiliza una memoria unificada.",
      "Von Neumann utiliza una memoria unificada para datos e instrucciones; Harvard utiliza memorias separadas.",
      "Harvard es más lenta que Von Neumann debido a su estructura de buses."
    ],
    "respuesta": 2,
    "explicacion": "La arquitectura de Von Neumann utiliza un único bus de datos y direcciones para la memoria, mientras que la arquitectura de Harvard utiliza buses y memorias separadas para datos e instrucciones."
  },
  {
    "pregunta": "Señale dos aplicaciones principales de los FPGAs.",
    "opciones": [
      "Virtual Reality (Realidad Virtual) y Datacenter Systems (Servidores).",
      "Procesadores de texto (Word Processors) y bases de datos personales.",
      "Sistemas de aire acondicionado residencial y calculadoras de bolsillo.",
      "Sistemas operativos de propósito general y navegadores web."
    ],
    "respuesta": 0,
    "explicacion": "Los FPGAs destacan en aplicaciones que requieren procesamiento masivo en paralelo y baja latencia, como la aceleración de datos en centros de datos, sistemas de Realidad Virtual y el procesamiento de señales en tiempo real."
  },
  {
    "pregunta": "¿Cuál es la función principal de la compuerta lógica NOR?",
    "opciones": [
      "Negar el resultado de una compuerta OR.",
      "Realizar la suma binaria de sus entradas.",
      "Negar individualmente cada entrada y luego realizar la operación AND.",
      "Solo genera un 1 si las entradas son iguales."
    ],
    "respuesta": 0,
    "explicacion": "La compuerta NOR (Not OR) es el inverso de la compuerta OR. Su función es negar (invertir) la salida de la operación OR, produciendo un 1 solo cuando ambas entradas son 0."
  },
  {
    "pregunta": "¿Qué expresión simplificada se obtiene al aplicar el teorema de De Morgan a la expresión $\\overline{A \\cdot B}$ (A AND B negada)?",
    "opciones": [
      "A \\cdot B'",
      "A' + B'",
      "A + B",
      "A' \\cdot B"
    ],
    "respuesta": 1,
    "explicacion": "El primer teorema de De Morgan establece que la negación de un producto (AND) es igual a la suma (OR) de las negaciones de las variables. "
  },
  {
    "pregunta": "¿Qué operación lógica representa la expresión $A \\cdot B$ en álgebra booleana?",
    "opciones": [
      "A OR B (Disyunción)",
      "A AND B (Conjunción)",
      "A XOR B (O Exclusiva)",
      "A NOT B (Inversión)"
    ],
    "respuesta": 1,
    "explicacion": "En álgebra booleana, el punto medio ($\cdot$) o la simple yuxtaposición (AB) representa la operación de multiplicación lógica, que es la operación AND o conjunción."
  },
  {
    "pregunta": "¿Cuál sería el valor de las salidas Q y Q negada (Q') en el circuito biestable D (Flip-Flop D) síncrono mostrado, cuando se aplica un pulso de reloj y la entrada D (SET) es 1?",
    "opciones": [
      "Q = 0, Q' = 1",
      "Q = 1, Q' = 1 (Estado inválido)",
      "Q = 1, Q' = 0",
      "Q y Q' mantienen su estado anterior (Memoria)"
    ],
    "respuesta": 2,
    "explicacion": "El biestable D (Data) transfiere el valor de su entrada D a la salida Q durante el pulso de reloj. Si la entrada D es 1, la salida Q será 1 y su negación Q' será 0. ",
    "imagen": "imagen/salida-de-q.png" 
  },
  {
    "pregunta": "¿Cuál es la principal ventaja de un velocímetro digital (electrónico) frente a uno analógico (mecánico)?",
    "opciones": [
      "El digital requiere menos energía para funcionar.",
      "El digital permite que los datos sean procesados y transmitidos de forma precisa, fiable y eficiente.",
      "El analógico es intrínsecamente más preciso a altas velocidades.",
      "El digital es más barato de fabricar que el analógico."
    ],
    "respuesta": 1,
    "explicacion": "La principal ventaja de los datos digitales es su capacidad para ser procesados, almacenados y transmitidos a otros sistemas (como la ECU o sistemas de navegación) con alta precisión y sin interferencias."
  },
  {
    "pregunta": "¿Qué se obtiene al negar (o invertir) la salida de una compuerta AND?",
    "opciones": [
      "Una compuerta OR",
      "Una compuerta XOR",
      "Una compuerta NAND",
      "Una compuerta NOR"
    ],
    "respuesta": 2,
    "explicacion": "La compuerta NAND es la forma negada (NOT) de la compuerta AND. Su función es la negación de la conjunción lógica, es decir, solo produce un 0 cuando todas las entradas son 1."
  },
  {
    "pregunta": "¿Cuál es la función principal de un mapa de Karnaugh (K-map) en la lógica digital?",
    "opciones": [
      "Es una herramienta para simular el comportamiento de un microprocesador.",
      "Es una herramienta para simplificar expresiones booleanas complejas.",
      "Es un método para convertir números binarios a código BCD.",
      "Es un diagrama para visualizar el flujo de datos en un circuito secuencial."
    ],
    "respuesta": 1,
    "explicacion": "El mapa de Karnaugh es una técnica gráfica que permite simplificar o minimizar expresiones lógicas booleanas, lo que reduce el número de compuertas necesarias en el circuito final."
  },
  {
    "pregunta": "¿Cuál es la forma simplificada de la expresión booleana A + A · B?",
    "opciones": [
      "A",
      "B",
      "A · B",
      "A + B"
    ],
    "respuesta": 0,
    "explicacion": "Esta expresión se simplifica utilizando la Ley de Absorción del Álgebra Booleana, donde A + (A · B) es igual a A. Esto es porque si A ya es 1, la salida es 1; si A es 0, la expresión es 0 + 0·B, que es 0. La salida siempre sigue el valor de A. "
  },
  {
    "pregunta": "¿A qué compuerta lógica corresponde la señal digital de salida 'X' basada en el diagrama de tiempos de las entradas 'A' y 'B'?",
    "opciones": [
      "Compuerta NAND",
      "Compuerta NOR",
      "Compuerta XNOR",
      "Compuerta XOR"
    ],
    "respuesta": 3,
    "explicacion": "Al analizar el diagrama, la salida 'X' se activa (valor 1) únicamente cuando las entradas 'A' y 'B' tienen valores lógicos diferentes. Este comportamiento es la definición funcional de la compuerta XOR (O Exclusiva).",
    "imagen": "imagen/salida-xor.png" 
  },
  {
    "pregunta": "En un circuito de compuertas OR, ¿cuál es la salida si al menos una entrada es 1?",
    "opciones": [
      "La salida siempre es 0.",
      "La salida es 1.",
      "La salida es de alta impedancia (Z).",
      "La salida se mantiene en su estado anterior."
    ],
    "respuesta": 1,
    "explicacion": "La compuerta OR (disyunción lógica) se activa o produce un 1 lógico si y solo si una o más de sus entradas están en estado 1 (Verdadero). Esta es su característica principal."
  },
  {
    "pregunta": "¿Qué representa una tabla de verdad, como la mostrada en la imagen, en el contexto de un circuito lógico?",
    "opciones": [
      "La secuencia de bits de entrada en el tiempo.",
      "La salida de un circuito en función de sus entradas.",
      "El número de transistores utilizados en la compuerta.",
      "La simplificación del diagrama de un mapa de Karnaugh."
    ],
    "respuesta": 1,
    "explicacion": "Una tabla de verdad es una herramienta utilizada en la lógica booleana para mostrar el comportamiento de un circuito lógico; lista todas las posibles combinaciones de las entradas y la salida resultante para cada combinación."
  },
  {
    "pregunta": "¿Cuál es la salida de una compuerta OR si ambas entradas son 0?",
    "opciones": [
      "1",
      "0",
      "Alta impedancia (Z)",
      "Indefinido"
    ],
    "respuesta": 1,
    "explicacion": "La compuerta OR requiere que al menos una entrada sea 1 para activarse. Si ambas son 0, la salida es 0."
  },
  {
    "pregunta": "¿En cuál de los siguientes casos se utilizaría un valor don't care (X)?",
    "opciones": [
      "Para forzar la salida a 1 en todo momento.",
      "Cuando un sensor de movimiento esté en nivel alto y bajo simultáneamente (estado imposible).",
      "Cuando se necesita reiniciar el sistema.",
      "Cuando se desconecta la fuente de poder."
    ],
    "respuesta": 1,
    "explicacion": "Los estados 'don't care' se usan en mapas de Karnaugh para combinaciones de entrada que físicamente no pueden ocurrir o no importan."
  },
  {
    "pregunta": "¿Cómo se representa la función lógica NOT en un diagrama lógico?",
    "opciones": [
      "Un círculo pequeño o burbuja en la salida",
      "Un cuadrado con una X dentro",
      "Una línea curva sin cierre",
      "Un rectángulo con el símbolo &"
    ],
    "respuesta": 0,
    "explicacion": "Gráficamente, la inversión (NOT) se denota con un pequeño círculo (burbuja), usualmente a la salida de un triángulo."
  },
  {
    "pregunta": "En el álgebra booleana, ¿cuál es la expresión simplificada de A + A'?",
    "opciones": [
      "0",
      "A",
      "A'",
      "1"
    ],
    "respuesta": 3,
    "explicacion": "Es una ley fundamental: sumar una variable con su inverso (A + A') siempre cubre todas las posibilidades, resultando en 1 (Verdadero)."
  },
  {
    "pregunta": "¿Cuál es la salida de una compuerta AND si ambas entradas son 1?",
    "opciones": [
      "0",
      "1",
      "Oscilante",
      "Null"
    ],
    "respuesta": 1,
    "explicacion": "La compuerta AND solo entrega una salida de 1 (Verdadero) cuando TODAS sus entradas son 1."
  },
  {
    "pregunta": "En un mapa de Karnaugh de dos variables, ¿cuántas celdas hay?",
    "opciones": [
      "2 celdas",
      "4 celdas",
      "8 celdas",
      "16 celdas"
    ],
    "respuesta": 1,
    "explicacion": "El número de celdas es 2 elevado al número de variables. Para 2 variables: 2^2 = 4."
  },
  {
    "pregunta": "¿Cuál es la salida de una compuerta NAND cuando ambas entradas son 0?",
    "opciones": [
      "0",
      "1",
      "Flotante",
      "Error de lógica"
    ],
    "respuesta": 1,
    "explicacion": "La NAND es la inversa de la AND. Si las entradas son 0 y 0, la AND daría 0. Al invertirlo, la NAND da 1."
  },
  {
    "pregunta": "De acuerdo a la compuerta lógica OR mostrada en la imagen, ¿cuál de las siguientes opciones representa correctamente la secuencia de sus salidas (S) para las combinaciones 00, 01, 10 y 11?",
    "opciones": [
      "0000",
      "0111",
      "1000",
      "1111"
    ],
    "respuesta": 1,
    "explicacion": "La compuerta OR produce una salida de 1 si al menos una de las entradas (A o B) es 1. Por lo tanto, la secuencia de salidas es S=0 para (0,0); S=1 para (0,1); S=1 para (1,0); y S=1 para (1,1).",
    "imagen": "imagen/Compuerta-or.png" 
  },
  {
    "pregunta": "¿Cuál sería el valor de las salidas Q y Qn si en el circuito biestable RS (Flip-Flop) mostrado, el valor del LOGICSTATE en la transición es R=0 y S=0, asumiendo que el circuito estaba previamente en un estado de Set (Q=1, Qn=0)?",
    "opciones": [
      "La salida Q cambia a cero y Qn cambia a uno.",
      "La salida Q y Qn cambian a cero.",
      "La salida Q permanece en uno y Qn permanece en cero.",
      "La salida Q y Qn cambian a uno."
    ],
    "respuesta": 2,
    "explicacion": "El circuito mostrado es un biestable RS. La condición R=0 y S=0 corresponde a la 'zona de memoria' del biestable (ya que usa compuertas NAND y NOR en cascada). Cuando las entradas R y S son 0, el biestable retiene el último estado. Dado que el estado anterior era Set (Q=1, Qn=0), este estado se mantiene.",
    "imagen": "imagen/salida-q.png"
  }
] 
